app/controllers/orders_controller.rb

  def create
    # @order.image.attach(order_params[:image])
    @order = Order.new(order_params)
    @order.user = current_user
    respond_to do |format|
      if @order.save
---
INSERT INTO `orders` (`Name`, `Description`, `Age`, `Cost`, `Address`, `created_at`, `updated_at`, `user_id`) VALUES ('Apple', 'ded', 23, 232.0, '2ewf', '2020-01-29 16:47:47', '2020-01-29 16:47:47', 1)